# Звягін М.С. 9.Принцип модульності.Функції. Завдання 3


def power(a, n):

    if n == 0:  # Випадок, коли степінь дорівнює 0
        return 1
    else:
        return a * power(a, n-1)  # Функція буде викликати саму себе, поки значення n не буде дорівнювати 0


m = float(input("Введіть дійсне додатнє число: "))

while m <= 0:  # Перевірка на доречність введенного значення
    m = float(input("Введіть дійсне додатнє число: "))

pwr = int(input("Введіть ціле невід'ємне значення степеня: "))

while pwr < 0:  # Перевірка на доречність введенного значення
    pwr = int(input("Введіть ціле невід'ємне значення степеня: "))


print("Число ", m, " в степені ", pwr, " дорівнює ", power(m, pwr))
